# Визначаємо функцію, що перетворює римські цифри у цілі числа
def roman_to_int(roman)
  # Хеш, що містить відповідності між римськими цифрами та їхніми числовими значеннями
  roman_numerals = {
    'I' => 1, 'V' => 5, 'X' => 10, 'L' => 50, 'C' => 100, 'D' => 500, 'M' => 1000
  }
  total = 0 # Змінна для збереження суми чисел під час перетворення
  prev_value = 0 # Змінна для збереження попереднього числового значення

  # Перевертаємо вхідний римський рядок та проходимося по кожному символу
  roman.reverse.each_char do |char|
    value = roman_numerals[char] # Отримуємо числове значення римського символу
    unless value
      puts "Неправильний римський символ: #{char}" # Виводимо повідомлення про помилку
      return nil
    end

    if value < prev_value
      total -= value # Якщо поточне значення менше попереднього, віднімаємо від суми
    else
      total += value # Інакше, додаємо до суми
    end

    prev_value = value # Оновлюємо попереднє значення
  end

  total # Повертаємо загальну суму
end

# Визначаємо функцію, що перетворює цілі числа в римські цифри
def int_to_roman(num)
  # Хеш, який містить відповідності між числовими значеннями та римськими цифрами
  roman_numerals = {
    1000 => 'M', 900 => 'CM', 500 => 'D', 400 => 'CD', 100 => 'C', 90 => 'XC',
    50 => 'L', 40 => 'XL', 10 => 'X', 9 => 'IX', 5 => 'V', 4 => 'IV', 1 => 'I'
  }

  roman = '' # Змінна для збереження римського числа
  # Проходимося по кожній парі (число, римська цифра) в хеші
  roman_numerals.each do |value, numeral|
    while num >= value
      roman += numeral # Додаємо римську цифру до результуючого рядка
      num -= value # Віднімаємо числове значення від вхідного числа
    end
  end
  roman # Повертаємо римське число
end

# Нескінченний цикл
loop do
  # Виводимо меню
  puts "Меню:"
  puts "1 - Перетворити римську цифру в ціле число"
  puts "2 - Перетворити ціле число в римську цифру"
  puts "0 - Вихід"
  choice = gets.chomp.to_i

  case choice
  when 1
    puts "Введіть римську цифру:"
    roman = gets.chomp.upcase
    result = roman_to_int(roman)
    puts "Результат: #{result}" if result
  when 2
    puts "Введіть ціле число:"
    num = gets.chomp.to_i
    if num >= 1 && num < 4000
      result = int_to_roman(num)
      puts "Результат: #{result}"
    else
      puts "Число повинно бути в діапазоні від 1 до 3999"
    end
  when 0
    puts "Дякую за використання програми. До побачення!"
    break # Виходимо з циклу при виборі 0
  else
    puts "Неправильний вибір. Будь ласка, введіть 1, 2 або 0." # Виводимо повідомлення про помилку
  end
end
